
## Plan Result (terraform/cloudflare/b0xp.io/argocd)

[CI link](https://github.com/boxp/arch/actions/runs/13736412634)


<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.argocd_api_tunnel_token
  * aws_ssm_parameter.github_action_secret
  * aws_ssm_parameter.github_action_token
  * cloudflare_access_application.argocd_api
  * cloudflare_access_policy.argocd_api_policy
  * cloudflare_access_service_token.github_action_token
  * cloudflare_record.argocd_api
  * cloudflare_tunnel.argocd_api_tunnel
  * cloudflare_tunnel_config.argocd_api_tunnel
  * time_rotating.token_rotation


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.argocd_api_tunnel_token will be created
  + resource "aws_ssm_parameter" "argocd_api_tunnel_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "for argocd-api tunnel token"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "argocd-api-tunnel-token"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.github_action_secret will be created
  + resource "aws_ssm_parameter" "github_action_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "for GitHub Action to access ArgoCD API"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "argocd-api-github-action-secret"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.github_action_token will be created
  + resource "aws_ssm_parameter" "github_action_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "for GitHub Action to access ArgoCD API"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "argocd-api-github-action-token"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # cloudflare_access_application.argocd_api will be created
  + resource "cloudflare_access_application" "argocd_api" {
      + account_id                   = (known after apply)
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + domain                       = "argocd-api.b0xp.io"
      + domain_type                  = (known after apply)
      + enable_binding_cookie        = false
      + id                           = (known after apply)
      + name                         = "Access application for argocd-api.b0xp.io"
      + options_preflight_bypass     = false
      + service_auth_401_redirect    = false
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = false
      + type                         = "self_hosted"
      + zone_id                      = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_access_policy.argocd_api_policy will be created
  + resource "cloudflare_access_policy" "argocd_api_policy" {
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "GitHub Actions access policy for argocd-api.b0xp.io"
      + precedence     = 1
      + zone_id        = "ec593206d0ef695c3aae3a4cb3173264"

      + include {
          + service_token = (known after apply)
        }
    }

  # cloudflare_access_service_token.github_action_token will be created
  + resource "cloudflare_access_service_token" "github_action_token" {
      + account_id           = "1984a4314b3e75f3bedce97c7a8e0c81"
      + client_id            = (known after apply)
      + client_secret        = (sensitive value)
      + duration             = (known after apply)
      + expires_at           = (known after apply)
      + id                   = (known after apply)
      + min_days_for_renewal = 30
      + name                 = "GitHub Action - ArgoCD API"
    }

  # cloudflare_record.argocd_api will be created
  + resource "cloudflare_record" "argocd_api" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "argocd-api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel.argocd_api_tunnel will be created
  + resource "cloudflare_tunnel" "argocd_api_tunnel" {
      + account_id   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "cloudflare argocd-api tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # cloudflare_tunnel_config.argocd_api_tunnel will be created
  + resource "cloudflare_tunnel_config" "argocd_api_tunnel" {
      + account_id = "1984a4314b3e75f3bedce97c7a8e0c81"
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = (known after apply)
              + service  = "http://argocd-server.argocd.svc.cluster.local:80"
            }
          + ingress_rule {
              + service = "http_status:404"
            }
        }
    }

  # time_rotating.token_rotation will be created
  + resource "time_rotating" "token_rotation" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with cloudflare_access_application.argocd,
  on access.tf line 2, in resource "cloudflare_access_application" "argocd":
   2: resource "cloudflare_access_application" "argocd" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 19 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.argocd,
  on dns.tf line 5, in resource "cloudflare_record" "argocd":
   5:   value   = cloudflare_tunnel.argocd_tunnel.cname

`value` is deprecated in favour of `content` and will be removed in the next
major release.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Deprecated Resource

  with cloudflare_access_application.argocd,
  on access.tf line 2, in resource "cloudflare_access_application" "argocd":
   2: resource "cloudflare_access_application" "argocd" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 19 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.argocd,
  on dns.tf line 5, in resource "cloudflare_record" "argocd":
   5:   value   = cloudflare_tunnel.argocd_tunnel.cname

`value` is deprecated in favour of `content` and will be removed in the next
major release.
```



<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2882,"Program":"tfcmt","SHA1":"cd5aa48bc52b1ee90dc0bc0900aefc58654134bd","Target":"terraform/cloudflare/b0xp.io/argocd","Vars":{},"WorkflowName":"pull_request_target"} -->